In [3]:
df = (
{
    'A': [1, 2, 3, 4, 5],
    'B': ['삼성_전자', '카카오', '네이버', 'SK', 'LG'],
    'C': [6, 7, 8, 9, 10],
    'D': [11, 12, 13, 14, 15]
}
)

df

{'A': [1, 2, 3, 4, 5],
 'B': ['삼성_전자', '카카오', '네이버', 'SK', 'LG'],
 'C': [6, 7, 8, 9, 10],
 'D': [11, 12, 13, 14, 15]}

In [6]:
import pandas as pd

In [16]:
df = pd.DataFrame(df)
df

   A      B   C   D
0  1  삼성_전자   6  11
1  2    카카오   7  12
2  3    네이버   8  13
3  4     SK   9  14
4  5     LG  10  15

In [28]:
df['B'].str.split('_', expand=True)

     0     1
0   삼성    전자
1  카카오  None
2  네이버  None
3   SK  None
4   LG  None

In [29]:
df

   A      B   C   D
0  1  삼성_전자   6  11
1  2    카카오   7  12
2  3    네이버   8  13
3  4     SK   9  14
4  5     LG  10  15